In [12]:
import pandas as pd
from datetime import datetime, timedelta
import numpy as np
from itertools import dropwhile
import sys
sys.path.insert(0, '/home/shail/bits/PS1/time_series_analysis')

In [13]:

df = pd.DataFrame([[10  ,      "Mumbai"   ,  '2015-12-01'  ]   ,               
   [1 ,       "Bangalore" , '2016-01-12'],
   [12    ,    "Pune"    ,   '2016-02-24'],
   [4    ,    "Mumbai"  ,    np.nan],
   [15   ,     "Delhi" ,     '2016-04-03'],
   [6   ,     "Mumbai"   ,    np.nan],
   [14    ,    "Bangalore" ,   np.nan],
  [ 5   ,     "Pune"    ,   '2016-07-31'],
   [8   ,     "Mumbai"  ,   '2016-12-19']], columns = ['value', 'city', 'date'])

In [14]:
df

   value       city        date
0     10     Mumbai  2015-12-01
1      1  Bangalore  2016-01-12
2     12       Pune  2016-02-24
3      4     Mumbai         NaN
4     15      Delhi  2016-04-03
5      6     Mumbai         NaN
6     14  Bangalore         NaN
7      5       Pune  2016-07-31
8      8     Mumbai  2016-12-19

In [15]:
from tsa.interpolation import impute_time_axis as impute

In [16]:
def get_freq(x):
    return 'M' if x.days == 28 else x

In [17]:
df['date'] = impute(df['date'], freq = timedelta(weeks = 4))

0

In [18]:
df

   value       city       date
0     10     Mumbai 2015-12-01
1      1  Bangalore 2016-01-12
2     12       Pune 2016-02-24
3      4     Mumbai 2016-03-14
4     15      Delhi 2016-04-03
5      6     Mumbai 2016-05-09
6     14  Bangalore 2016-07-04
7      5       Pune 2016-07-31
8      8     Mumbai 2016-12-19

In [19]:
from tsa.interpolation import interpolate_dates

In [21]:
new_df = interpolate_dates(df, 'date', ['value'], 'd')
new_df

         value       date
0    10.000000 2015-12-01
1     9.785714 2015-12-02
2     9.571429 2015-12-03
3     9.357143 2015-12-04
4     9.142857 2015-12-05
..         ...        ...
380   7.914894 2016-12-15
381   7.936170 2016-12-16
382   7.957447 2016-12-17
383   7.978723 2016-12-18
384   8.000000 2016-12-19

[385 rows x 2 columns]